
// Константы.

/**
 * Ширина основного холста в пикселях.
 */
var SCR_W = 800;

/**
 * Полуширина основного холста в пикселях.
 */
var SCR_HW = SCR_W / 2

/**
 * Высота основного холста в пикселях.
 */
var SCR_H = 600;

/**
 * Полувысота основного холста в пикселях.
 */
var SCR_HH = SCR_H / 2

/**
 * Количество кадров в секунду.
 */
var FPS = 50;

/**
 * Ширина ячейки карты в пикселях.
 */
var CELL_W = 32;

/**
 * Полуширина ячейки карты в пикселях.
 */
var CELL_HW = CELL_W / 2;

/**
 * Высота ячейки карты в пикселях.
 */
var CELL_H = 32;

/**
 * Полувысота ячейки карты в пикселях.
 */
var CELL_HH = CELL_H / 2;

/**
 * Скорость юнитов по-умолчанию.
 */
var DEFAULT_SPEED = 0.4;